package com.games.auctionhouse.utils;

public class AuctionUtil {
    //广告
    public static void advertisement(){
        System.out.println("=============================================================================================");
        System.out.println("欢迎各位来到星空拍卖行，每233年举办一次的万界拍卖会，即将在这里举行");
        System.out.println("在这里只有你想不到的物品，没有你得不到的");
        System.out.println("让我们一起来狂欢吧！！！");
        System.out.println("=============================================================================================");
    }
    //菜单栏
    public static void menu(){
        /*System.out.println("1. 充值金额"+"\t"+"2.全部商品"+"\t"+"3.购物车"+"\t"+"4.上架商品"+"\t"+"5.搜索商品"
                +"\t"+"6.我的百宝囊"+"7.个人中心"+"8.我的百宝囊");*/
        System.out.println("==================\t    菜单栏\t      =======================");
        System.out.println("==================\t 1. 充值金额\t  ======================");
        System.out.println("==================\t 2. 全部商品\t  ======================");
        System.out.println("==================\t 3. 购物车\t      ======================");
        System.out.println("==================\t 4. 上架商品\t  ======================");
        System.out.println("==================\t 5. 搜索商品\t  ======================");
        System.out.println("==================\t 6. 我的百宝囊\t  ======================");
        System.out.println("==================\t 7. 个人中心\t  ======================");
        System.out.println("==================\t 8. 排行榜\t      ======================");
        System.out.println("==================\t 9. 退出登录\t  ======================");
    }


}
